# Email Marketing Dashboard

# import

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns 

from plotly.subplots import make_subplots
import plotly.express as px
import plotly.graph_objects as go
from jupyter_dash import JupyterDash
import dash_core_components as dcc
import dash_html_components as html
from dash.dependencies import Input, Output, State
import dash

# Read CSV

In [2]:
df = pd.read_csv('Email Marketing Analysis.csv')

# Data Information

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Column1        10000 non-null  object
 1   Type           10000 non-null  object
 2   Status         10000 non-null  object
 3   City           9927 non-null   object
 4   State          9874 non-null   object
 5   PostalCode     9999 non-null   float64
 6   GenderCode     10000 non-null  object
 7   BirthDate      10000 non-null  object
 8   MaritalStatus  10000 non-null  object
 9   Enrolled on    10000 non-null  object
 10  Living status  10000 non-null  object
dtypes: float64(1), object(10)
memory usage: 859.5+ KB

In [4]:
df.describe(exclude= 'number')

,Column1,Type,Status,City,State,GenderCode,BirthDate,MaritalStatus,Enrolled on,Living status
count,10000,10000,10000,9927,9874,10000,10000,10000,10000,10000
unique,10000,2,3,388,35,4,6719,2,577,3
top,03B55CC9-6668-11e9-9B68-0050569857FB,Individual,Active,Hyderabad,TELANGANA,MALE,1-Jan-00,M,12-Aug-18,couple with children
freq,1,9736,9900,2639,4304,6887,244,9676,209,4825

# Check missing Values

In [5]:
df["City"].value_counts()

Hyderabad         2639
Secunderabad      2093
Mumbai            1498
Hyderabad City     976
Thane              227
                  ...
Yerraguntla          1
Anand                1
Alwar                1
Silchar              1
Vashi                1
Name: City, Length: 388, dtype: int64

# Pre-prosses

In [6]:
df['City'].isnull().sum()

73

In [7]:
df['State'].isnull().sum()

126

In [8]:
df.isnull().sum()

Column1            0
Type               0
Status             0
City              73
State            126
PostalCode         1
GenderCode         0
BirthDate          0
MaritalStatus      0
Enrolled on        0
Living status      0
dtype: int64

In [9]:
City_mode = df['City'].mode()[0]
City_mode

'Hyderabad'

In [10]:
# Replace NaN values with mode
df['City'] = df['City'].replace(np.NaN, City_mode)

In [11]:
df['City'].isnull().sum()

0

In [12]:
df.describe(include=[object])

,Column1,Type,Status,City,State,GenderCode,BirthDate,MaritalStatus,Enrolled on,Living status
count,10000,10000,10000,10000,9874,10000,10000,10000,10000,10000
unique,10000,2,3,388,35,4,6719,2,577,3
top,03B55CC9-6668-11e9-9B68-0050569857FB,Individual,Active,Hyderabad,TELANGANA,MALE,1-Jan-00,M,12-Aug-18,couple with children
freq,1,9736,9900,2712,4304,6887,244,9676,209,4825

In [13]:
df['Status'] = df['Status'].replace("Inactive", 'InActive')

In [14]:
State_mode = df['State'].mode()[0]
State_mode

'TELANGANA'

In [15]:
df['State'] = df['State'].replace(np.NaN, State_mode)

In [16]:
df['State'].isnull().sum()

0

In [17]:
df.rename(columns = {'Column1':'ID'}, inplace = True)

In [18]:
df=df.drop(['PostalCode'],axis=1)

In [19]:
df

,ID,Type,Status,City,State,GenderCode,BirthDate,MaritalStatus,Enrolled on,Living status
0,00005DCC-4E51-41A5-91C5-6635B24C7D17,Business,InActive,Hyderabad,TELANGANA,MALE,12-Aug-18,U,12-Aug-18,couple with children
1,0001F49E-9FE7-11e8-9E9C-00505682069A,Individual,Active,Valsad,GUJARAT,MALE,2-Nov-92,M,14-Aug-18,couple with children
2,0001F4A2-9FE7-11e8-9E9C-00505682069A,Individual,Active,Secunderabad,TELANGANA,FEMALE,25-Nov-88,M,14-Aug-18,couple with children
3,0001F4CD-9FE7-11e8-9E9C-00505682069A,Individual,Active,Nalgonda,TELANGANA,MALE,13-Jun-83,M,14-Aug-18,couple with children
4,0001F4DE-9FE7-11e8-9E9C-00505682069A,Individual,Active,Hyderabad,TELANGANA,MALE,13-Jul-75,M,14-Aug-18,couple with children
...,...,...,...,...,...,...,...,...,...,...
9995,0476D7F9-6B51-11e8-B278-0050569D3164,Individual,Active,Hyderabad,Telangana,MALE,3-Jul-97,M,9-Jun-18,Couple without children
9996,0476D7FD-6B51-11e8-B278-0050569D3164,Individual,Active,Hyderabad,ANDHRA PRADESH,MALE,24-May-80,M,9-Jun-18,Couple without children
9997,0476D812-6B51-11e8-B278-0050569D3164,Individual,Active,Secunderabad,ANDHRA PRADESH,FEMALE,22-Nov-84,M,9-Jun-18,Couple without children
9998,0476D81A-6B51-11e8-B278-0050569D3164,Individual,Active,Hyderabad City,ANDHRA PRADESH,FEMALE,14-Jul-94,M,9-Jun-18,Couple without children
9999,0476D821-6B51-11e8-B278-0050569D3164,Individual,Active,Secunderabad,ANDHRA PRADESH,MALE,9-Jul-77,M,9-Jun-18,Couple without children

# DashBoard

In [20]:
app = JupyterDash(__name__)

#_______________________________________________________

app.layout = html.Div([
    html.H1('Email Marketing Report',style={'color':'#191970','text-align':'center'}),
    html.Img(src=app.get_asset_url('Email.png'),style={'height':'30%', 'width':'30%'}),   
    html.H3("Choose Column Name:",style={'color': '#191970','width': '20%'}),
    html.Br(),
    dcc.Dropdown(
        id='name', 
        options=[
            {'label': 'Type', 'value': 'Type'},
            {'label': 'Status', 'value': 'Status'},
            {'label': 'GenderCode', 'value': 'GenderCode'},
            {'label': 'Living status', 'value': 'Living status'},
            {'label': 'MaritalStatus', 'value': 'MaritalStatus'}],
        value = 'Type',
        multi=False,
        style={'width': '40%'}
    ),
    html.Br(),
    dcc.Graph(id="pie"),
    
    html.Br(),
    dcc.Graph(id="subplot"),
    html.Br(),
    html.H3("Choose State Name:",style={'color': '#191970','width': '20%'}),
    dcc.Dropdown(
        id='State',
        options=[
            {'label': i, 'value': i}
            for i in df['State'].unique()
        ],
        value='TELANGANA',
        style={'width': '40%'}
    ),
    html.Br(),
    html.H3("Choose Gender Code:",style={'color': '#191970','width': '20%'}),
    html.Br(),    
    dcc.RadioItems(id = 'GenderCode',
                   options= [
                       {'label': i, 'value': i}
                       for i in df['GenderCode'].unique()],
                   value='MALE'),
    html.Br(),    
    dcc.Graph(id="subscatter"),


])

#____________________________________________________________

@app.callback(
    [Output("pie", "figure"),
    Output("subplot", "figure"),
    Output("subscatter", "figure")],
    [Input("name", "value"),
    Input("State", "value"),
    Input("GenderCode", "value")])

def generate_chart(names,option_affected,option_Gender):
    
    ddf = df.copy()
    dff = df.copy()
    dff = dff[dff["State"] == option_affected]
    dff = dff[dff["GenderCode"] == option_Gender]
          
    fig_pie=px.pie(data_frame=ddf,
               names=names,
               title=f" values of {names}",
               color_discrete_sequence=px.colors.sequential.Viridis,)
    fig_pie.update_layout(paper_bgcolor="LightSteelBlue",width=1000,height=500)  
    
    fig = make_subplots(
    rows=1, cols=2,)

    fig.add_trace(go.Box(y=dff["BirthDate"],name = "")
                  ,row=1, col=1)
    fig.add_trace(go.Histogram(x=dff["Enrolled on "],marker_color='#483D8B',name = None)
                  ,row=1, col=2)


    fig.update_layout(width=1000,height=500,
                  paper_bgcolor="LightSteelBlue",showlegend=False,
                     title= f'Birth date and Enrolled  {option_Gender} and {option_affected}')
    
    
    fig1 = make_subplots(
    rows=1, cols=3,)

    fig1.add_trace(go.Scatter(x=dff["Living status"],mode='markers')
                  ,row=1, col=1)
    fig1.add_trace(go.Scatter(x=dff["Status"],mode='markers')
                  ,row=1, col=2)
    fig1.add_trace(go.Scatter(x=dff["Type"],mode='markers')
                  ,row=1, col=3)

    fig1.update_layout(width=1000,height=500,
                       paper_bgcolor="LightSteelBlue",
                       title= f'Comparing between Living status,Status and Type by {option_Gender} and {option_affected}',
                       showlegend=False)

    


    return (fig_pie,fig,fig1)

    
    

if __name__ == '__main__':
    app.run_server(mode="inline", debug=False, port=8052)

 * Running on http://127.0.0.1:8052/ (Press CTRL+C to quit)
127.0.0.1 - - [15/Mar/2022 23:10:42] "GET /_alive_4ff9b96f-a7a9-4309-8a40-763a100ec415 HTTP/1.1" 200 -

127.0.0.1 - - [15/Mar/2022 23:10:42] "GET / HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:44] "GET / HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:44] "GET /_dash-layout HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:44] "GET /_dash-dependencies HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:44] "GET /_dash-dependencies HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:44] "GET /_dash-layout HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:45] "GET /assets/Email.png HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:45] "GET /assets/Email.png HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:45] "GET /_favicon.ico HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:45] "POST /_dash-update-component HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:45] "POST /_dash-update-component HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:10:59] "POST /_dash-update-component HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:11:05] "POST /_dash-update-component HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:11:10] "POST /_dash-update-component HTTP/1.1" 200 -
127.0.0.1 - - [15/Mar/2022 23:11:15] "POST /_dash-update-component HTTP/1.1" 200 -